10/data/attachments/db58a60d6a83e2c7.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_2f7c1038-5e21-4cc2-b8a3-8c59f27f5cdc</nif:username>
            <nif:friendToBeAdded>Jennifer_radio_Friend_53397_9</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>